
number = '0123456789'
# symbol_s = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~µ•·℃☎㎍㈜ '
# symbol = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~µ•·℃☎㎍㈜'
symbol_s = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~ '
symbol = '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'
pool_ko_2350 = "가각간갇갈갉갊감갑값갓갔강갖갗같갚갛개객갠갤갬갭갯갰갱갸갹갼걀걋걍걔걘걜거걱건걷걸걺검겁것겄겅겆겉겊겋게겐겔겜겝겟겠겡겨격겪견겯결겸겹겻겼경곁계곈곌곕곗고곡곤곧골곪곬곯곰곱곳공곶과곽관괄괆괌괍괏광괘괜괠괩괬괭괴괵괸괼굄굅굇굉교굔굘굡굣구국군굳굴굵굶굻굼굽굿궁궂궈궉권궐궜궝궤궷귀귁귄귈귐귑귓규균귤그극근귿글긁금급긋긍긔기긱긴긷길긺김깁깃깅깆깊까깍깎깐깔깖깜깝깟깠깡깥깨깩깬깰깸깹깻깼깽꺄꺅꺌꺼꺽꺾껀껄껌껍껏껐껑께껙껜껨껫껭껴껸껼꼇꼈꼍꼐꼬꼭꼰꼲꼴꼼꼽꼿꽁꽂꽃꽈꽉꽐꽜꽝꽤꽥꽹꾀꾄꾈꾐꾑꾕꾜꾸꾹꾼꿀꿇꿈꿉꿋꿍꿎꿔꿜꿨꿩꿰꿱꿴꿸뀀뀁뀄뀌뀐뀔뀜뀝뀨끄끅끈끊끌끎끓끔끕끗끙끝끼끽낀낄낌낍낏낑나낙낚난낟날낡낢남납낫났낭낮낯낱낳내낵낸낼냄냅냇냈냉냐냑냔냘냠냥너넉넋넌널넒넓넘넙넛넜넝넣네넥넨넬넴넵넷넸넹녀녁년녈념녑녔녕녘녜녠노녹논놀놂놈놉놋농높놓놔놘놜놨뇌뇐뇔뇜뇝뇟뇨뇩뇬뇰뇹뇻뇽누눅눈눋눌눔눕눗눙눠눴눼뉘뉜뉠뉨뉩뉴뉵뉼늄늅늉느늑는늘늙늚늠늡늣능늦늪늬늰늴니닉닌닐닒님닙닛닝닢다닥닦단닫달닭닮닯닳담답닷닸당닺닻닿대댁댄댈댐댑댓댔댕댜더덕덖던덛덜덞덟덤덥덧덩덫덮데덱덴델뎀뎁뎃뎄뎅뎌뎐뎔뎠뎡뎨뎬도독돈돋돌돎돐돔돕돗동돛돝돠돤돨돼됐되된될됨됩됫됴두둑둔둘둠둡둣둥둬뒀뒈뒝뒤뒨뒬뒵뒷뒹듀듄듈듐듕드득든듣들듦듬듭듯등듸디딕딘딛딜딤딥딧딨딩딪따딱딴딸땀땁땃땄땅땋때땍땐땔땜땝땟땠땡떠떡떤떨떪떫떰떱떳떴떵떻떼떽뗀뗄뗌뗍뗏뗐뗑뗘뗬또똑똔똘똥똬똴뙈뙤뙨뚜뚝뚠뚤뚫뚬뚱뛔뛰뛴뛸뜀뜁뜅뜨뜩뜬뜯뜰뜸뜹뜻띄띈띌띔띕띠띤띨띰띱띳띵라락란랄람랍랏랐랑랒랖랗래랙랜랠램랩랫랬랭랴략랸럇량러럭런럴럼럽럿렀렁렇레렉렌렐렘렙렛렝려력련렬렴렵렷렸령례롄롑롓로록론롤롬롭롯롱롸롼뢍뢨뢰뢴뢸룀룁룃룅료룐룔룝룟룡루룩룬룰룸룹룻룽뤄뤘뤠뤼뤽륀륄륌륏륑류륙륜률륨륩륫륭르륵른를름릅릇릉릊릍릎리릭린릴림립릿링마막만많맏말맑맒맘맙맛망맞맡맣매맥맨맬맴맵맷맸맹맺먀먁먈먕머먹먼멀멂멈멉멋멍멎멓메멕멘멜멤멥멧멨멩며멱면멸몃몄명몇몌모목몫몬몰몲몸몹못몽뫄뫈뫘뫙뫼묀묄묍묏묑묘묜묠묩묫무묵묶문묻물묽묾뭄뭅뭇뭉뭍뭏뭐뭔뭘뭡뭣뭬뮈뮌뮐뮤뮨뮬뮴뮷므믄믈믐믓미믹민믿밀밂밈밉밋밌밍및밑바박밖밗반받발밝밞밟밤밥밧방밭배백밴밸뱀뱁뱃뱄뱅뱉뱌뱍뱐뱝버벅번벋벌벎범법벗벙벚베벡벤벧벨벰벱벳벴벵벼벽변별볍볏볐병볕볘볜보복볶본볼봄봅봇봉봐봔봤봬뵀뵈뵉뵌뵐뵘뵙뵤뵨부북분붇불붉붊붐붑붓붕붙붚붜붤붰붸뷔뷕뷘뷜뷩뷰뷴뷸븀븃븅브븍븐블븜븝븟비빅빈빌빎빔빕빗빙빚빛빠빡빤빨빪빰빱빳빴빵빻빼빽뺀뺄뺌뺍뺏뺐뺑뺘뺙뺨뻐뻑뻔뻗뻘뻠뻣뻤뻥뻬뼁뼈뼉뼘뼙뼛뼜뼝뽀뽁뽄뽈뽐뽑뽕뾔뾰뿅뿌뿍뿐뿔뿜뿟뿡쀼쁑쁘쁜쁠쁨쁩삐삑삔삘삠삡삣삥사삭삯산삳살삵삶삼삽삿샀상샅새색샌샐샘샙샛샜생샤샥샨샬샴샵샷샹섀섄섈섐섕서석섞섟선섣설섦섧섬섭섯섰성섶세섹센셀셈셉셋셌셍셔셕션셜셤셥셧셨셩셰셴셸솅소속솎손솔솖솜솝솟송솥솨솩솬솰솽쇄쇈쇌쇔쇗쇘쇠쇤쇨쇰쇱쇳쇼쇽숀숄숌숍숏숑수숙순숟술숨숩숫숭숯숱숲숴쉈쉐쉑쉔쉘쉠쉥쉬쉭쉰쉴쉼쉽쉿슁슈슉슐슘슛슝스슥슨슬슭슴습슷승시식신싣실싫심십싯싱싶싸싹싻싼쌀쌈쌉쌌쌍쌓쌔쌕쌘쌜쌤쌥쌨쌩썅써썩썬썰썲썸썹썼썽쎄쎈쎌쏀쏘쏙쏜쏟쏠쏢쏨쏩쏭쏴쏵쏸쐈쐐쐤쐬쐰쐴쐼쐽쑈쑤쑥쑨쑬쑴쑵쑹쒀쒔쒜쒸쒼쓩쓰쓱쓴쓸쓺쓿씀씁씌씐씔씜씨씩씬씰씸씹씻씽아악안앉않알앍앎앓암압앗았앙앝앞애액앤앨앰앱앳앴앵야약얀얄얇얌얍얏양얕얗얘얜얠얩어억언얹얻얼얽얾엄업없엇었엉엊엌엎에엑엔엘엠엡엣엥여역엮연열엶엷염엽엾엿였영옅옆옇예옌옐옘옙옛옜오옥온올옭옮옰옳옴옵옷옹옻와왁완왈왐왑왓왔왕왜왝왠왬왯왱외왹왼욀욈욉욋욍요욕욘욜욤욥욧용우욱운울욹욺움웁웃웅워웍원월웜웝웠웡웨웩웬웰웸웹웽위윅윈윌윔윕윗윙유육윤율윰윱윳융윷으윽은을읊음읍읏응읒읓읔읕읖읗의읜읠읨읫이익인일읽읾잃임입잇있잉잊잎자작잔잖잗잘잚잠잡잣잤장잦재잭잰잴잼잽잿쟀쟁쟈쟉쟌쟎쟐쟘쟝쟤쟨쟬저적전절젊점접젓정젖제젝젠젤젬젭젯젱져젼졀졈졉졌졍졔조족존졸졺좀좁좃종좆좇좋좌좍좔좝좟좡좨좼좽죄죈죌죔죕죗죙죠죡죤죵주죽준줄줅줆줌줍줏중줘줬줴쥐쥑쥔쥘쥠쥡쥣쥬쥰쥴쥼즈즉즌즐즘즙즛증지직진짇질짊짐집짓징짖짙짚짜짝짠짢짤짧짬짭짯짰짱째짹짼쨀쨈쨉쨋쨌쨍쨔쨘쨩쩌쩍쩐쩔쩜쩝쩟쩠쩡쩨쩽쪄쪘쪼쪽쫀쫄쫌쫍쫏쫑쫓쫘쫙쫠쫬쫴쬈쬐쬔쬘쬠쬡쭁쭈쭉쭌쭐쭘쭙쭝쭤쭸쭹쮜쮸쯔쯤쯧쯩찌찍찐찔찜찝찡찢찧차착찬찮찰참찹찻찼창찾채책챈챌챔챕챗챘챙챠챤챦챨챰챵처척천철첨첩첫첬청체첵첸첼쳄쳅쳇쳉쳐쳔쳤쳬쳰촁초촉촌촐촘촙촛총촤촨촬촹최쵠쵤쵬쵭쵯쵱쵸춈추축춘출춤춥춧충춰췄췌췐취췬췰췸췹췻췽츄츈츌츔츙츠측츤츨츰츱츳층치칙친칟칠칡침칩칫칭카칵칸칼캄캅캇캉캐캑캔캘캠캡캣캤캥캬캭컁커컥컨컫컬컴컵컷컸컹케켁켄켈켐켑켓켕켜켠켤켬켭켯켰켱켸코콕콘콜콤콥콧콩콰콱콴콸쾀쾅쾌쾡쾨쾰쿄쿠쿡쿤쿨쿰쿱쿳쿵쿼퀀퀄퀑퀘퀭퀴퀵퀸퀼큄큅큇큉큐큔큘큠크큭큰클큼큽킁키킥킨킬킴킵킷킹타탁탄탈탉탐탑탓탔탕태택탠탤탬탭탯탰탱탸턍터턱턴털턺텀텁텃텄텅테텍텐텔템텝텟텡텨텬텼톄톈토톡톤톨톰톱톳통톺톼퇀퇘퇴퇸툇툉툐투툭툰툴툼툽툿퉁퉈퉜퉤튀튁튄튈튐튑튕튜튠튤튬튱트특튼튿틀틂틈틉틋틔틘틜틤틥티틱틴틸팀팁팃팅파팍팎판팔팖팜팝팟팠팡팥패팩팬팰팸팹팻팼팽퍄퍅퍼퍽펀펄펌펍펏펐펑페펙펜펠펨펩펫펭펴편펼폄폅폈평폐폘폡폣포폭폰폴폼폽폿퐁퐈퐝푀푄표푠푤푭푯푸푹푼푿풀풂품풉풋풍풔풩퓌퓐퓔퓜퓟퓨퓬퓰퓸퓻퓽프픈플픔픕픗피픽핀필핌핍핏핑하학한할핥함합핫항해핵핸핼햄햅햇했행햐향허헉헌헐헒험헙헛헝헤헥헨헬헴헵헷헹혀혁현혈혐협혓혔형혜혠혤혭호혹혼홀홅홈홉홋홍홑화확환활홧황홰홱홴횃횅회획횐횔횝횟횡효횬횰횹횻후훅훈훌훑훔훗훙훠훤훨훰훵훼훽휀휄휑휘휙휜휠휨휩휫휭휴휵휸휼흄흇흉흐흑흔흖흗흘흙흠흡흣흥흩희흰흴흼흽힁히힉힌힐힘힙힛힝"

pool_en = "abcdefghijklmnopqrstuvwxyz"
pool_En = "ABCDEFGHIJKLMNOPQRSTUVWXYZ"
pool_EN = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ"



pool = "!\"#$%&'*+-/0123456789:;<=>?ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz" + \
"{|}~©°²½ÁÄÅÇÉÍÎÓÖ×ÜßàáâãäåæçèéêëìíîïðñòóôõöøúûüýāăąćČčđēėęěğīİıŁłńňōřŞşŠšţūźżŽžȘșΑΔαλφГОавлорстя​’“”→" + \
"∇∼「」アカグニランㄱㄴㄷㄸㄹㅂㅅㅆㅇㅈㅊㅋㅌㅎㅓㅜㅣ一丁七三上下不丑世丘丞中丸丹主乃久之乎乘九也乳乾事二云" + \
"互五井亞亡交亥亨享京亭人仁今他仙代令以仰仲件任企伊伍伎伏伐休伯伴伸佃佈位低住佐何佛作使來供依侯侵侶便俗保俠信" + \
"修俱俳倉個倍倒候借値倫倭假偈偉偏停偶傅傑傳傷傾像僞僥僧價儀儉儒優儼兀允元兆先光克兒入內全八公六共兵其具典兼再" + \
"冠冥冶准凞凡凱出函刀分刊刑列初判別利到制券刺刻則前剛副創劃劑力功加劣助劫勇動務勝勢勳勸匈化北匠區十千午半卍卑" + \
"卒卓南博卜占卦印危卵卷卽卿厄原厦去參又叉友反叔受口古句可台史右司各合吉同名后吏吐君吠吳呂告周味呵命和咳咸咽哀" + \
"品哨哮哲唐唯唱商問啼善喆喉喜喩喪嘗器嚴囊四回因困固圈國圍園圓圖團土在地均坊坐坑坵型垢城域埴執培基堂堅堆堤堯報" + \
"場塔塚塞塵境墜墟墨墳墾壁壇壓壤士壬壯壺壽夏夕外多夜夢大天太夫央失夷奄奇奉奎奏契奔奮女奴好如妄妊妖妙始姑姓姚姜" + \
"威婆婚婦媒媚子孔字存孝孟季孤孫學孺宇守安宋宗官宙定客宣室宮害家容寂寃寄寅密寇富寒寓實審寫寬寶寸寺封將專尊對小" + \
"少尙尹尼尿局居屈屋屍屎屛層屬山岐岡岩岳岸峙峰島峻峽崇崔崖崩嶋巖川州巢工左巧巨巫差己巷市布帝師帶常帽干平年幹幻" + \
"幼幽庇序店府度座庫庭康廟廣廳延廷建廻弁式弑弓引弘弟弱張强弼彌彛形彬影役彼彿往征待律後徐徑得從循微德徹心必忌忍" + \
"志忠思怡急性恐恒恨恩悅悖患悲情惑惟惠惡想惺愁意愚愛感愼慈態慕慣慧慾憂憤憺應懸戎成我戟戮戰戴戶房所手才打批承技" + \
"抄把抗抱抽拇拓拘拙拜拾持指捌捨捿授掌排接推提揚揭援損搗摩播操擒擔擘據擧攘攝攬支改攻放政故敍敎救敗散敬整數文斗" + \
"料斛斜斧斯新斷方於施旋族旗日旨早旱昌明易昔星春昧昭是時晉晋晩普景晴晶智暈暑暗暘曉曜曠曦曰曲書曹曼曾最會月有朋" + \
"服望朝期木未末本朱朴李材村杖杜杞杭杯東松板林果枝枯枰枾柏柑柱栗校栢核根格桀桂案桎桑桓桔梁梏梓梗條梨梵棗棟森植" + \
"椒楊楓楚業楮極榮槃槍樂樓樗樣樸樹樺樽橄橋橘機橡檀檎權欌欖次欲歌歐止正此步武歲歸死殖段殷殺殿毅母毒比毛氏民氣水" + \
"永求汎汗江池沅沒沖沙沛河油治沼沿泉泊法泗泡波注泰洋洙洛洞津洲活派流浅浦浮浴海涅涇消涌液淑淡淨淫深淳淵淸渠渡游" + \
"渾湖湯源溪溫溶滄滅滋滯滿漁漆漢漫漸潑潤潭澄澎澤澳澹濁濕濟濤濯瀋瀝灣火灰灸災炎炭点烈烏烙焚無焦然煌煎照煬煮熟熱" + \
"燁燈燔燕燥燧燮爲爵父片版牌牛牝牟牡物特犧犬狀狗猥猩猪獨獵獸獻玄玉王玲珍珠珪班現球理琴瑞瑟瑪璃璋璽瓜瓦甑甘生産" + \
"用甫田由甲申男界畏留畜畢略番異畵當畸疏疑疫疹疼病症痔痛痺瘀瘍瘡療癌癖登發白百的皆皇皮盂盆益盛盜盟盡盤盧目直相" + \
"省看眞眼睡督瞋矢矣知短石破碍碑磁磨磬示社祇祖祝神祥祭祺禁禅禍福禦禪禮禹禽禾秀私秉秋科秘秤秦秩移稀稗種稱稷稼稽" + \
"穀穆積空窮竅立章童竭端竹笑符第筆等筍答策箋箕管箱節篇簡米粉粘粥精糖糞系紀紂約紅紋純紙級素索紫紬累細紳終組結絡" + \
"統絲絶絹經綠維綱網綸綽緖線緣緯縣縱總織繡繩繪繭纂續罕置罰羅羊美群義羽翁習翟老考者而耐耕耳聃聖聞聰聲職肇肉肖肝" + \
"股肥育肺胃胎胚胞胡胥能脂脈脚脛脣脩脫脯脾腋腎腫腸腹膜膠膨膽臆臟臣臥臨自至致臺臼臾與興舊舌舍舒舜舟般船艦良色芋" + \
"花芳芽苑苔苕苛苞若苦英茂茵茶茹荀荇草荒荷莊莫菊菌菜菩菫華菴菽萊萍萬落葉著葛董葬蒙蒜蒲蒸蒿蓮蔓蔘蔡蔬蕃蕉蕓薄薑" + \
"薛薩薪薺藏藝藤藥藩藻蘆蘇蘊蘚蘭虎處虛虞虹蜀蜂蜜蝕蝶融蟬蟲蠶蠻血衆行術衛衡衣表袁裔裕裙補製複襄西要見視親覺觀角" + \
"解言訂訊訓託記訣設診註評詩話詵誅誌認誕語誠誤誥誦說調談諍論諡諫諭諸謙講謝謠證識譚譜譯議護讀變谷豆豊豚象豪豫貝" + \
"貞財貧貨貪貫貴貸費資賊賓賞賢賣賦質贍赤赫走起超越趙趣趨足趾跋跡路踏蹟身躬車軍軒軟載輓輕輪輯輸輻輿轅轉辨辭辯辰" + \
"農近迦述追逆透逐通逝造逢連進逵遂遊運遍過道達遠遡適遷選遺遽還邊邑那邪郞郡部都鄒鄕鄭鄲配酒酸醉醫醯釋里重野量釐" + \
"金針鈍鈴鉞銀銅銘鋼錄錢錦鎭鏡鐘鐵鑑鑛長門閃開間閔閣閥閭閻闕關阪防阿陀降限陝院陰陳陵陶陸陽隆隊隋階際障隣隨隱隷" + \
"雀雄雅集雇雌雖雙雜離難雨雪雲電霜露靈靑靖靜非面革靴鞏韓音韶韻順須頊頌領頭顔願顚類顯風飛食飢飮飯飾養餓餘首香馨" + \
"馬駒騫騷驕骨骸髓體高髥髮鬪鬱鬼魏魔魚魯鮮鰍鰐鳥鳧鳳鴨鵲鶴鷄鷹鹽鹿麗麥麻黃黑默點黨鼎齊齋齒龍龜" + \
"가각간갇갈갉감갑값갓갔강갖갗같갚갛개객갠갤갬갭갯갰갱갸걀걔걘거걱건걷걸검겁것겄겅겆겉겊겋게겐겔겟겠겡겨격겪견" + \
"결겸겹겻겼경곁계곕곗고곡곤곧골곪곬곯곰곱곳공곶과곽관괄괌광괘괜괭괴괸굉교구국군굳굴굵굶굼굽굿궁궂궈권궐궜궝궤" + \
"귀귄귈귓규균귤그극근글긁금급긋긍기긴길김깁깃깅깊까깍깎깐깔깜깝깟깡깥깨깬깰깻깼깽꺄꺼꺽꺾껀껄껌껍껏껐껑께껴꼈" + \
"꼍꼐꼬꼭꼴꼼꼽꼿꽁꽂꽃꽉꽝꽤꽥꾀꾜꾸꾹꾼꿀꿇꿈꿉꿋꿍꿎꿔꿨꿩꿰꿴뀄뀌뀐뀔뀜뀝끄끈끊끌끓끔끕끗끙끝끼끽낀낄낌낍" + \
"낏낑나낙낚난낟날낡남납낫났낭낮낯낱낳내낵낸낼냄냅냇냈냉냐냔냘냥너넉넋넌널넓넘넙넛넜넝넣네넥넨넬넴넵넷넸넹녀녁" + \
"년념녔녕녘녜노녹논놀놈놋농높놓놔놨뇌뇨뇩뇽누눅눈눌눔눕눗눠눴뉘뉜뉩뉴늄늅늉느늑는늘늙늠늡능늦늪늬니닉닌닐님닙" + \
"닛닝닢다닥닦단닫달닭닮닯닳담답닷당닻닿대댁댄댈댐댑댓댔댕댜더덕덖던덜덟덤덥덧덩덫덮데덱덴델뎀뎃뎅뎌뎠뎨도독돈" + \
"돋돌돔돕돗동돛돝돼됐되된될됨됩됴두둑둔둘둠둡둣둥둬뒀뒤뒬뒷뒹듀듈듐드득든듣들듦듬듭듯등듸디딕딘딛딜딤딥딧딨딩" + \
"딪따딱딴딸땀땄땅때땐땔땜땝땠땡떠떡떤떨떫떰떱떳떴떵떻떼떽뗀뗄뗍뗏뗐뗑또똑똘똥뙤뚜뚝뚤뚫뚱뛰뛴뛸뜀뜁뜨뜩뜬뜯뜰" + \
"뜸뜻띄띈띌띔띕띠띤띨띱띵라락란랄람랍랏랐랑랒랗래랙랜랠램랩랫랬랭랴략량러럭런럴럼럽럿렀렁렇레렉렌렐렘렙렛렝려" + \
"력련렬렴렵렷렸령례로록론롤롬롭롯롱롸롹뢰뢴뢸룃료룐룡루룩룬룰룸룹룻룽뤄뤘뤼류륙륜률륨륭르륵른를름릅릇릉릎리릭" + \
"린릴림립릿링마막만많맏말맑맘맙맛망맞맡맣매맥맨맬맴맵맷맸맹맺먀먁머먹먼멀멈멋멍멎메멕멘멜멤멥멧멩며멱면멸몄명" + \
"몇모목몫몬몰몸몹못몽뫼묘무묵묶문묻물묽뭄뭅뭇뭉뭍뭏뭐뭔뭘뭡뭣뮈뮌뮐뮤뮬므믈믐미믹민믿밀밈밉밋밌밍및밑바박밖반" + \
"받발밝밟밤밥밧방밭배백밴밸뱀뱁뱃뱄뱅뱉뱍뱐버벅번벌범법벗벙벚베벡벤벨벰벱벳벵벼벽변별볍볏볐병볕보복볶본볼봄봅" + \
"봇봉봐봤뵈뵐뵙부북분붇불붉붐붓붕붙뷔뷰뷴뷸브븐블비빅빈빌빔빕빗빙빚빛빠빡빤빨빳빴빵빻빼빽뺀뺄뺌뺏뺐뺑뺨뻐뻑뻔" + \
"뻗뻘뻣뻤뻥뻬뼈뼉뼘뽀뽈뽐뽑뽕뾰뿌뿍뿐뿔뿜쁘쁜쁠쁨삐삔삘사삭삯산살삵삶삼삽삿샀상샅새색샌샐샘샙샛샜생샤샨샬샴샵" + \
"샷샹서석섞선섣설섬섭섯섰성섶세섹센셀셈셉셋셌셍셔션셜셨셰셴셸소속손솔솜솝솟송솥쇄쇠쇤쇳쇼숀숄숍수숙순숟술숨숩" + \
"숫숭숯숱숲숴쉐쉘쉬쉭쉰쉴쉼쉽슈슐슘슛슝스슥슨슬슭슴습슷승시식신싣실싫심십싯싱싶싸싹싼쌀쌈쌉쌌쌍쌓쌔쌘쌩써썩썬" + \
"썰썸썹썼썽쎄쎈쏘쏙쏜쏟쏠쏭쏴쐈쐐쐬쑤쑥쑨쒀쒔쓰쓱쓴쓸씀씁씌씨씩씬씰씸씹씻씽아악안앉않알앎앓암압앗았앙앞애액앤" + \
"앨앰앱앳앴앵야약얀얄얇얌얍얏양얕얗얘얜어억언얹얻얼얽엄업없엇었엉엊엌엎에엑엔엘엠엡엣엥여역엮연열엷염엽엾엿였" + \
"영옅옆옇예옌옐옙옛오옥온올옭옮옳옴옵옷옹옻와왁완왈왑왓왔왕왜왠왱외왼요욕욘욜욤용우욱운울움웁웃웅워웍원월웜웠" + \
"웡웨웬웰웸웹위윅윈윌윔윗윙유육윤율윱윳융으윽은을읊음읍응의읜읠이익인일읽잃임입잇있잉잊잎자작잔잖잘잠잡잣잤장" + \
"잦재잭잰잴잽잿쟀쟁쟈쟉쟤저적전절젊점접젓정젖제젝젠젤젬젭젯져젼졀졌졍조족존졸좀좁종좇좋좌좍좽죄죠죤주죽준줄줌" + \
"줍줏중줘줬쥐쥔쥘쥬쥴즈즉즌즐즘즙증지직진짇질짊짐집짓징짖짙짚짜짝짠짢짤짧짬짭짰짱째짹짼쨀쨉쨋쨌쨍쩄쩌쩍쩐쩔쩜" + \
"쩝쩡쩨쪄쪘쪼쪽쪾쫀쫄쫑쫓쫙쬐쭈쭉쭐쭙쯔쯤쯧찌찍찐찔찜찝찡찢찧차착찬찮찰참찹찻찼창찾채책챈챌챔챕챗챘챙챠챤처척" + \
"천철첨첩첫청체첵첸첼쳄쳇쳉쳐쳔쳤초촉촌촘촛총촨촬최쵸추축춘출춤춥춧충춰췄췌취췬츄츠측츨츰층치칙친칠칡침칩칫칭" + \
"카칵칸칼캄캅캇캉캐캔캘캠캡캣캤캥캬커컥컨컫컬컴컵컷컸컹케켄켈켐켓켕켜켠켤켭켯켰코콕콘콜콤콥콧콩콰콱콴콸쾅쾌쾡" + \
"쾨쾰쿄쿠쿡쿤쿨쿰쿵쿼퀀퀄퀘퀭퀴퀵퀸퀼큐큘크큰클큼큽키킥킨킬킴킵킷킹타탁탄탈탉탐탑탓탔탕태택탠탤탬탭탯탰탱터턱" + \
"턴털텀텁텃텄텅테텍텐텔템텝텡텨톈토톡톤톨톰톱톳통퇴툇투툭툰툴툼퉁퉈퉜튀튄튈튕튜튠튤튬트특튼튿틀틈틉틋틔티틱틴" + \
"틸팀팁팅파팍팎판팔팜팝팟팠팡팥패팩팬팰팸팻팼팽퍼퍽펀펄펌펍펐펑페펙펜펠펨펩펫펭펴편펼폄폈평폐포폭폰폴폼폿퐁표" + \
"푭푸푹푼풀품풋풍퓨퓬퓰퓸프픈플픔픕피픽핀필핌핍핏핑하학한할핥함합핫항해핵핸핼햄햅햇했행햐향헀허헉헌헐험헙헛헝" + \
"헤헥헨헬헴헵헷헹혀혁현혈혐협혓혔형혜호혹혼홀홈홉홋홍홑화확환활홧황홰홱횃회획횝횟횡효후훅훈훌훑훔훗훤훨훼휄휑" + \
"휘휙휜휠휩휭휴휼흄흉흐흑흔흘흙흠흡흣흥흩희흰흽히힉힌힐힘힙힝" + \
"車滑金奈羅洛卵欄蘭郎來盧老魯綠鹿論雷樓縷凌樂不參葉沈若兩凉梁呂女廬麗黎曆歷戀蓮連列烈裂念獵靈領例禮醴惡尿料遼" + \
"龍暈柳流類六陸倫律栗利李梨理離燐林臨立茶切宅"